In [384]:
it_salary_2018_columns = ['Age', 'Gender', 'City', 'Position', 'Years of experience', 'Current Salary', 'Salary one year ago', 'Salary two years ago','Are you getting any Stock Options?', 'Company type']
it_salary_2019_columns = [
    'Age', 
    'Gender', 
    'City', 
    'Seniority level', 
    'Position (without seniority)', 
    'Years of experience', 
    'Your main technology / programming language',
    'Yearly brutto salary (without bonus and stocks)', 
    'Company type',
    'Company business sector']
it_salary_2020_columns = [
    'Age', 
    'Gender', 
    'City', 
    'Position ',
    'Total years of experience',
    'Seniority level',  
    'Your main technology / programming language',
    'Other technologies/programming languages you use often',
    'Yearly brutto salary (without bonus and stocks) in EUR',
    'Annual bonus+stocks one year ago. Only answer if staying in same country',
    'Employment status',
    'Ð¡ontract duration',
    'Company type']

levels_fyi_columns = ['company', 'title', 'totalyearlycompensation', 'location', 'yearsofexperience', 'yearsatcompany', 'basesalary',
'Race_White', 'Race_Two_Or_More', 'Race_Black', 'Race_Hispanic', 'Race']

ds_salaries_columns = ['job_title', 'salary', 'salary_in_usd']

software_professional_columns = ['Company Name', 'Job Title', 'Salary']

cyber_salaries_columns = ['job_title', 'salary_in_usd']

In [385]:
import pandas as pd
import numpy as np

it_salary_eu_2020 = pd.read_csv('datasets/IT_Salary_Survey_EU_2020.csv', encoding='ISO-8859-1', sep=','
,           usecols=it_salary_2020_columns
            )

it_salary_eu_2018 = pd.read_csv('datasets/IT_Salary_Survey_EU_2018.csv', encoding='ISO-8859-1', 
    usecols=it_salary_2018_columns)
it_salary_eu_2019 = pd.read_csv('datasets/IT_Salary_Survey_EU_2019.csv', encoding='ISO-8859-1'
    , usecols=it_salary_2019_columns
    )

# Data Science is stem - Good integrity
levels_fyi_salaries = pd.read_csv('datasets/Levels_Fyi_Salary_Data.csv', encoding='ISO-8859-1'
, usecols=levels_fyi_columns
)

# Data Science Salaries
ds_salaries = pd.read_csv('datasets/ds_salaries.csv', encoding='ISO-8859-1'
, usecols=ds_salaries_columns
)

# From Glassdoor India
software_professional_datasets = pd.read_csv('datasets/Software_Professional_Salaries.csv', encoding='ISO-8859-1'
, usecols=software_professional_columns
)

# From Survey
cyber_salaries = pd.read_csv('datasets/salaries_cyber.csv', encoding='ISO-8859-1', usecols=cyber_salaries_columns)

<h1>Exploration</h1>

<p>IT Salaries Surveys<p>

In [386]:
it_salary_eu_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1253 entries, 0 to 1252
Data columns (total 13 columns):
 #   Column                                                                    Non-Null Count  Dtype
---  ------                                                                    --------------  -----
 0   Age                                                                       1226 non-null   float64
 1   Gender                                                                    1243 non-null   object
 2   City                                                                      1253 non-null   object
 3   Position                                                                  1247 non-null   object
 4   Total years of experience                                                 1237 non-null   object
 5   Seniority level                                                           1241 non-null   object
 6   Your main technology / programming language                               1126 non-null   object
 7   Other technologies/programming languages you use often                    1096 non-null   object
 8   Yearly brutto salary (without bonus and stocks) in EUR                    1253 non-null   float64
 9   Annual bonus+stocks one year ago. Only answer if staying in same country  614 non-null    object
 10  Employment status                                                         1236 non-null   object
 11  Ð¡ontract duration                                                        1224 non-null   object
 12  Company type                                                              1228 non-null   object
dtypes: float64(2), object(11)
memory usage: 127.4+ KB

In [387]:
it_salary_eu_2020['Seniority level'].unique()

array(['Senior', 'Lead', 'Junior', 'Middle', 'Head', nan, 'No level',
       'VP', 'Manager', 'Work Center Manager', 'CTO', 'No level ',
       'Director', 'Key', 'C-level executive manager', 'Principal',
       'intern', 'Student', 'no idea, there are no ranges in the firm ',
       'C-Level', 'Working Student', 'Entry level', 'Intern', 'student',
       'Self employed'], dtype=object)

In [388]:
it_salary_eu_2020.head()

,Age,Gender,City,Position,Total years of experience,Seniority level,Your main technology / programming language,Other technologies/programming languages you use often,Yearly brutto salary (without bonus and stocks) in EUR,Annual bonus+stocks one year ago. Only answer if staying in same country,Employment status,Ð¡ontract duration,Company type
0,26.0,Male,Munich,Software Engineer,5,Senior,TypeScript,"Kotlin, Javascript / Typescript",80000.0,10000,Full-time employee,Unlimited contract,Product
1,26.0,Male,Berlin,Backend Developer,7,Senior,Ruby,NaN,80000.0,5000,Full-time employee,Unlimited contract,Product
2,29.0,Male,Berlin,Software Engineer,12,Lead,Javascript / Typescript,"Javascript / Typescript, Docker",120000.0,100000,Self-employed (freelancer),Temporary contract,Product
3,28.0,Male,Berlin,Frontend Developer,4,Junior,Javascript,NaN,54000.0,NaN,Full-time employee,Unlimited contract,Startup
4,37.0,Male,Berlin,Backend Developer,17,Senior,C# .NET,".NET, SQL, AWS, Docker",62000.0,NaN,Full-time employee,Unlimited contract,Product

In [389]:
# EDA
it_salary_eu_2020.sample()

# TODO: 
# 1. Combine Total Years into Float - LATER
# 2. Combine Programming Languages columns into a single column - DONE
# 3. Get info on Annual bonus+stocks colunm

# Skills Columns
it_salary_eu_2020['Skills'] = it_salary_eu_2020['Your main technology / programming language'] + it_salary_eu_2020['Other technologies/programming languages you use often']

# Salary Column
it_salary_eu_2020['Current Salary'] = it_salary_eu_2020['Yearly brutto salary (without bonus and stocks) in EUR']

# Bonus Column
it_salary_eu_2020['Additional Compensation'] = it_salary_eu_2020['Annual bonus+stocks one year ago. Only answer if staying in same country']

it_salary_eu_2020['Position'] = it_salary_eu_2020['Position ']


#it_salary_eu_2020.rename(columns={'Total years of experience': 'Years Of Experience', 'Salary': 'Current Salary'}, inplace=True)

it_salary_eu_2020[['Age', 'Gender', 'Position', 'Total years of experience', 'Skills', 'City', 'Current Salary', 'Additional Compensation', 'Company type']]

,Age,Gender,Position,Total years of experience,Skills,City,Current Salary,Additional Compensation,Company type
0,26.0,Male,Software Engineer,5,"TypeScriptKotlin, Javascript / Typescript",Munich,80000.0,10000,Product
1,26.0,Male,Backend Developer,7,NaN,Berlin,80000.0,5000,Product
2,29.0,Male,Software Engineer,12,Javascript / TypescriptJavascript / Typescript...,Berlin,120000.0,100000,Product
3,28.0,Male,Frontend Developer,4,NaN,Berlin,54000.0,NaN,Startup
4,37.0,Male,Backend Developer,17,"C# .NET.NET, SQL, AWS, Docker",Berlin,62000.0,NaN,Product
...,...,...,...,...,...,...,...,...,...
1248,31.0,Male,Backend Developer,9,"JavaPython, Javascript / Typescript, Java / Sc...",Berlin,70000.0,72000,Product
1249,33.0,Male,Researcher/ Consumer Insights Analyst,10,NaN,Berlin,60000.0,2500,Product
1250,39.0,Male,IT Operations Manager,15,"PHPPython, C/C++, Javascript / Typescript, Jav...",Munich,110000.0,NaN,eCommerce
1251,26.0,Male,Frontend Developer,7,"JavaScriptJavascript / Typescript, Docker, HTM...",SaarbrÃ¼cken,38350.0,36400,Product
1252,26.0,Male,DevOps,2,"yamlPython, AWS, Kubernetes, Docker, terraform...",Berlin,65000.0,0,Startup

In [390]:
it_salary_eu_2018[['Age', 'Gender', 'City', 'Position', 'Are you getting any Stock Options?', 'Company type']]

,Age,Gender,City,Position,Are you getting any Stock Options?,Company type
0,43.0,M,MÃ¼nchen,QA Ingenieur,No,Product
1,33.0,F,MÃ¼nchen,Senior PHP Magento developer,No,Product
2,32.0,M,MÃ¼nchen,Software Engineer,No,Product
3,25.0,M,MÃ¼nchen,Senior Frontend Developer,Yes,Product
4,39.0,M,MÃ¼nchen,UX Designer,No,Ecom retailer
...,...,...,...,...,...,...
760,40.0,M,KÃ¶ln,Java Developer junior,Yes,Product
761,NaN,M,KÃ¶ln,E.g. C# Developer,Yes,Product
762,NaN,M,KÃ¶ln,E.g. C# Developer,Yes,Product
763,NaN,NaN,NaN,NaN,NaN,NaN
764,31.0,F,MÃ¼nchen,Pm,No,Product

In [391]:
#print(it_salary_eu_2019.head())

# Changing to skills 
it_salary_eu_2019['Skills'] = it_salary_eu_2019['Your main technology / programming language']

it_salary_eu_2019['Current Salary'] = it_salary_eu_2019['Yearly brutto salary (without bonus and stocks)']

it_salary_eu_2019['Position'] = it_salary_eu_2019['Position (without seniority)']

it_salary_eu_2019[['Age', 'Gender', 'Position', 'Years of experience', 'Skills', 'City', 'Current Salary', 'Company type', 'Company business sector']]

,Age,Gender,Position,Years of experience,Skills,City,Current Salary,Company type,Company business sector
0,33.0,Male,Fullstack Developer,13,PHP,Berlin,64000.0,Startup,Tourism
1,29.0,Male,Backend Developer,3,Python,Berlin,55000.0,Product,Scientific Activities
2,NaN,Male,Mobile Developer,4,Kotlin,Berlin,70000.0,Startup,NaN
3,30.0,Male,Backend Developer,6,PHP,Berlin,63000.0,Product,Transport
4,32.0,Male,Embedded Developer,10,C/C++,Berlin,66000.0,Product,Automotive
...,...,...,...,...,...,...,...,...,...
986,30.0,Male,Backend Developer,10,Python,Amsterdam,71000.0,Product,Telecom
987,28.0,Male,Security Engineer,7,Not Relevant,Amsterdam,72000.0,Bank,Finance / Insurance
988,42.0,Male,Manager,9,Not Relevant,Munich,68000.0,Product,Ð¡ommerce
989,33.0,Male,Software Architect,15,Javascript / Typescript,Berlin,100000.0,Product,Health
990,32.0,Male,Fullstack Developer,5,Java,Frankfurt,63000.0,Consulting / Agency,Transport

In [392]:
it_2020 = it_salary_eu_2020[['Age', 'Gender', 'Position', 'Total years of experience', 'Skills', 'City', 'Current Salary', 'Additional Compensation', 'Company type']]
it_2019 = it_salary_eu_2019[['Age', 'Gender', 'Position', 'Years of experience', 'Skills', 'City', 'Current Salary', 'Company type', 'Company business sector']]
it_2018 = it_salary_eu_2018[['Age', 'Gender', 'City', 'Position', 'Are you getting any Stock Options?', 'Company type', 'Years of experience', 'Current Salary']]

Levels FYI Salaries

In [393]:
levels_fyi_salaries['Company'] = levels_fyi_salaries['company']
levels_fyi_salaries['Position'] = levels_fyi_salaries['title']
levels_fyi_salaries['Salary'] = levels_fyi_salaries['basesalary']
levels_fyi_salaries['Years of experience'] = levels_fyi_salaries['yearsofexperience']
levels_fyi_salaries['Current Salary'] = levels_fyi_salaries['Salary'].replace(0, np.nan)
levels_fyi_salaries['Current Salary'] = levels_fyi_salaries['Salary'].fillna(levels_fyi_salaries['totalyearlycompensation'])
levels_fyi_salaries['Additional Compensation'] = levels_fyi_salaries['totalyearlycompensation'] - levels_fyi_salaries['Salary']

levels_data = levels_fyi_salaries[['Company', 'Position', 'Race', 'Current Salary', 'Additional Compensation', 'Years of experience']]

In [394]:
levels_fyi_salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62642 entries, 0 to 62641
Data columns (total 18 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   company                  62637 non-null  object
 1   title                    62642 non-null  object
 2   totalyearlycompensation  62642 non-null  int64
 3   location                 62642 non-null  object
 4   yearsofexperience        62642 non-null  float64
 5   yearsatcompany           62642 non-null  float64
 6   basesalary               62642 non-null  float64
 7   Race_White               62642 non-null  int64
 8   Race_Two_Or_More         62642 non-null  int64
 9   Race_Black               62642 non-null  int64
 10  Race_Hispanic            62642 non-null  int64
 11  Race                     22427 non-null  object
 12  Company                  62637 non-null  object
 13  Position                 62642 non-null  object
 14  Salary                   62642 non-null  float64
 15  Years of experience      62642 non-null  float64
 16  Current Salary           62642 non-null  float64
 17  Additional Compensation  62642 non-null  float64
dtypes: float64(7), int64(5), object(6)
memory usage: 8.6+ MB

In [395]:
it_2020.head()

,Age,Gender,Position,Total years of experience,Skills,City,Current Salary,Additional Compensation,Company type
0,26.0,Male,Software Engineer,5,"TypeScriptKotlin, Javascript / Typescript",Munich,80000.0,10000,Product
1,26.0,Male,Backend Developer,7,NaN,Berlin,80000.0,5000,Product
2,29.0,Male,Software Engineer,12,Javascript / TypescriptJavascript / Typescript...,Berlin,120000.0,100000,Product
3,28.0,Male,Frontend Developer,4,NaN,Berlin,54000.0,NaN,Startup
4,37.0,Male,Backend Developer,17,"C# .NET.NET, SQL, AWS, Docker",Berlin,62000.0,NaN,Product

In [396]:
it_2019.head()

,Age,Gender,Position,Years of experience,Skills,City,Current Salary,Company type,Company business sector
0,33.0,Male,Fullstack Developer,13,PHP,Berlin,64000.0,Startup,Tourism
1,29.0,Male,Backend Developer,3,Python,Berlin,55000.0,Product,Scientific Activities
2,NaN,Male,Mobile Developer,4,Kotlin,Berlin,70000.0,Startup,NaN
3,30.0,Male,Backend Developer,6,PHP,Berlin,63000.0,Product,Transport
4,32.0,Male,Embedded Developer,10,C/C++,Berlin,66000.0,Product,Automotive

In [397]:
it_2018.head()

,Age,Gender,City,Position,Are you getting any Stock Options?,Company type,Years of experience,Current Salary
0,43.0,M,MÃ¼nchen,QA Ingenieur,No,Product,11.0,77000.0
1,33.0,F,MÃ¼nchen,Senior PHP Magento developer,No,Product,8.0,65000.0
2,32.0,M,MÃ¼nchen,Software Engineer,No,Product,10.0,88000.0
3,25.0,M,MÃ¼nchen,Senior Frontend Developer,Yes,Product,6.0,78000.0
4,39.0,M,MÃ¼nchen,UX Designer,No,Ecom retailer,10.0,69000.0

In [398]:
levels_data.head()

,Company,Position,Race,Current Salary,Additional Compensation,Years of experience
0,Oracle,Product Manager,NaN,107000.0,20000.0,1.5
1,eBay,Software Engineer,NaN,0.0,100000.0,5.0
2,Amazon,Product Manager,NaN,155000.0,155000.0,8.0
3,Apple,Software Engineering Manager,NaN,157000.0,215000.0,7.0
4,Microsoft,Software Engineer,NaN,0.0,157000.0,5.0

In [414]:
final_cols = ['Age', 'Gender', 'City', 'Position', 'Years Of Experience', 'Additional Compensation', 'Current Salary', 'Company Type', 'Industry', 'Skills', 'Company', 'Race']

it_2019_clean = it_2019.rename(columns={'Years of experience': 'Years Of Experience', 'Company type': 'Company Type', 'Company business sector': 'Industry'})

it_2020_clean = it_2020.rename(columns={'Total years of experience': 'Years Of Experience', 'Company type': 'Company Type'})

it_2018_clean = it_2018.rename(columns={'Company type': 'Company Type', 'Are you getting any Stock Options?': 'Stock Options', 'Years of experience': 'Years Of Experience'})

levels_data_clean = levels_data.rename(columns={'Years of experience': 'Years Of Experience'})

In [415]:
levels_data_clean.columns

Index(['Company', 'Position', 'Race', 'Current Salary',
       'Additional Compensation', 'Years Of Experience'],
      dtype='object')

In [416]:
# Adding Extra Columns to Each Dataset 

# Levels - columns needed - Company Type, Industry, Stock Options?, City, Country, Skills
# it_2019 - Stock Options?, Company, Race, Additional Compensation
# it_2018 - Industry, Race, Company, Skills

In [417]:
it_2019_clean.loc[:, 'Additional Compensation'] = pd.Series(dtype=float)
it_2019_clean.loc[:, 'Race'] = pd.Series(dtype=object)
it_2019_clean.loc[:, 'Additional Compensation'] = pd.Series(dtype=float)
it_2019_clean.loc[:, 'Company'] = pd.Series(dtype=float)

it_2019_clean.head()

,Age,Gender,Position,Years Of Experience,Skills,City,Current Salary,Company Type,Industry,Additional Compensation,Race,Company
0,33.0,Male,Fullstack Developer,13,PHP,Berlin,64000.0,Startup,Tourism,NaN,NaN,NaN
1,29.0,Male,Backend Developer,3,Python,Berlin,55000.0,Product,Scientific Activities,NaN,NaN,NaN
2,NaN,Male,Mobile Developer,4,Kotlin,Berlin,70000.0,Startup,NaN,NaN,NaN,NaN
3,30.0,Male,Backend Developer,6,PHP,Berlin,63000.0,Product,Transport,NaN,NaN,NaN
4,32.0,Male,Embedded Developer,10,C/C++,Berlin,66000.0,Product,Automotive,NaN,NaN,NaN

In [418]:
it_2020_clean.loc[:, 'Stock Options'] = pd.Series(dtype=object)
it_2020_clean.loc[:, 'Race'] = pd.Series(dtype=object)
it_2020_clean.loc[:, 'Company'] = pd.Series(dtype=float)
it_2020_clean.loc[:, 'Industry'] = pd.Series(dtype=float)

it_2020_clean.head()

,Age,Gender,Position,Years Of Experience,Skills,City,Current Salary,Additional Compensation,Company Type,Stock Options,Race,Company,Industry
0,26.0,Male,Software Engineer,5,"TypeScriptKotlin, Javascript / Typescript",Munich,80000.0,10000,Product,NaN,NaN,NaN,NaN
1,26.0,Male,Backend Developer,7,NaN,Berlin,80000.0,5000,Product,NaN,NaN,NaN,NaN
2,29.0,Male,Software Engineer,12,Javascript / TypescriptJavascript / Typescript...,Berlin,120000.0,100000,Product,NaN,NaN,NaN,NaN
3,28.0,Male,Frontend Developer,4,NaN,Berlin,54000.0,NaN,Startup,NaN,NaN,NaN,NaN
4,37.0,Male,Backend Developer,17,"C# .NET.NET, SQL, AWS, Docker",Berlin,62000.0,NaN,Product,NaN,NaN,NaN,NaN

In [419]:
it_2018_clean.loc[:, 'Additional Compensation'] = pd.Series(dtype=float)
it_2018_clean.loc[:, 'Industry'] = pd.Series(dtype=object)
it_2018_clean.loc[:, 'Company'] = pd.Series(dtype=object)
it_2018_clean.loc[:, 'Race'] = pd.Series(dtype=object)
it_2018_clean.loc[:, 'Skills'] = pd.Series(dtype=object)

it_2018_clean.head()

,Age,Gender,City,Position,Stock Options,Company Type,Years Of Experience,Current Salary,Additional Compensation,Industry,Company,Race,Skills
0,43.0,M,MÃ¼nchen,QA Ingenieur,No,Product,11.0,77000.0,NaN,NaN,NaN,NaN,NaN
1,33.0,F,MÃ¼nchen,Senior PHP Magento developer,No,Product,8.0,65000.0,NaN,NaN,NaN,NaN,NaN
2,32.0,M,MÃ¼nchen,Software Engineer,No,Product,10.0,88000.0,NaN,NaN,NaN,NaN,NaN
3,25.0,M,MÃ¼nchen,Senior Frontend Developer,Yes,Product,6.0,78000.0,NaN,NaN,NaN,NaN,NaN
4,39.0,M,MÃ¼nchen,UX Designer,No,Ecom retailer,10.0,69000.0,NaN,NaN,NaN,NaN,NaN

In [420]:
levels_data_clean.loc[:, 'Industry'] = pd.Series(dtype=object)
levels_data_clean.loc[:, 'Company Type'] = pd.Series(dtype=object)
levels_data_clean.loc[:, 'Age'] = pd.Series(dtype=float)
levels_data_clean.loc[:, 'Gender'] = pd.Series(dtype=object)
levels_data_clean.loc[:, 'Additional Compensation'] = pd.Series(dtype=object)
levels_data_clean.loc[:, 'City'] = pd.Series(dtype=object)
levels_data_clean.loc[:, 'Skills'] = pd.Series(dtype=object)

levels_data_clean.head()

,Company,Position,Race,Current Salary,Additional Compensation,Years Of Experience,Industry,Company Type,Age,Gender,City,Skills
0,Oracle,Product Manager,NaN,107000.0,NaN,1.5,NaN,NaN,NaN,NaN,NaN,NaN
1,eBay,Software Engineer,NaN,0.0,NaN,5.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Amazon,Product Manager,NaN,155000.0,NaN,8.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Apple,Software Engineering Manager,NaN,157000.0,NaN,7.0,NaN,NaN,NaN,NaN,NaN,NaN
4,Microsoft,Software Engineer,NaN,0.0,NaN,5.0,NaN,NaN,NaN,NaN,NaN,NaN

In [421]:
final_dataset = pd.concat([it_2018_clean[final_cols], it_2019_clean[final_cols], it_2020_clean[final_cols], levels_data_clean[final_cols]], axis=0)

# Replace Additional Compensation With 0 if null
final_dataset['Additional Compensation'].fillna(0, inplace=True)

In [427]:
final_dataset.to_csv("datasets/final_dataset.csv", index=False)

In [428]:
final_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65651 entries, 0 to 62641
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      2780 non-null   float64
 1   Gender                   2985 non-null   object
 2   City                     2980 non-null   object
 3   Position                 65616 non-null  object
 4   Years Of Experience      65602 non-null  object
 5   Additional Compensation  614 non-null    object
 6   Current Salary           65635 non-null  float64
 7   Company Type             2918 non-null   object
 8   Industry                 846 non-null    object
 9   Skills                   2016 non-null   object
 10  Company                  62637 non-null  object
dtypes: float64(2), object(9)
memory usage: 6.0+ MB

In [430]:
# Cleaning DataSet

# Age - Fine
# Gender - 
final_dataset['Gender'] = final_dataset.Gender.replace(['Diverse'], np.nan).str.slice(0)

In [431]:
final_dataset.loc[:, final_dataset.Company.isnull() == False]

ValueError: cannot reindex from a duplicate axis